{"meta":{"title":"Hexo","subtitle":"","description":"","author":"John Doe","url":"http://example.com","root":"/"},"pages":[],"posts":[{"title":"云计算技术与应用介绍及课程实验教程分享","slug":"云计算技术与应用介绍及课程实验教程分享","date":"2021-08-20T02:18:38.000Z","updated":"2021-08-20T03:57:51.187Z","comments":true,"path":"2021/08/20/云计算技术与应用介绍及课程实验教程分享/","link":"","permalink":"http://example.com/2021/08/20/%E4%BA%91%E8%AE%A1%E7%AE%97%E6%8A%80%E6%9C%AF%E4%B8%8E%E5%BA%94%E7%94%A8%E4%BB%8B%E7%BB%8D%E5%8F%8A%E8%AF%BE%E7%A8%8B%E5%AE%9E%E9%AA%8C%E6%95%99%E7%A8%8B%E5%88%86%E4%BA%AB/","excerpt":"&emsp;&ensp;一个没有理想的人，好似一枝没有准星的枪，一个没有目标的人，好似一只到处纷飞的羽毛，往往有时候我们都有一双攀天巨足，往往有时候我们都有一双腾飞的翅膀，唯独没有一双洞察人间迷雾的双眸和一个体味人生百态的心房。","text":"&emsp;&ensp;一个没有理想的人，好似一枝没有准星的枪，一个没有目标的人，好似一只到处纷飞的羽毛，往往有时候我们都有一双攀天巨足，往往有时候我们都有一双腾飞的翅膀，唯独没有一双洞察人间迷雾的双眸和一个体味人生百态的心房。 云计算应用技术简介&emsp;&ensp;云计算应用技术以多层次、分岗位学习项目为载体，采用双线并行的架构，将理论知识和单项岗位训练贯穿其中。按照云计算运维、云应用开发、虚拟技术等岗位技能的要求，引入行业职业标准，把从业人员实际工作中应用的知识纳入教学内容中。 云计算应用技术由浅入深，全面、系统地介绍了云计算的相关知识。主要内容包括云计算基础知识、虚拟技术、腾讯云计算、Google云计算、微软云计算、分布式框架Hadoop、分布式数据库HBase以及国内云计算平台。 一、虚拟化技术&emsp;&ensp;计算机虚拟化技术是一个广义的术语，在计算机方面通常是指计算元件在虚拟的基础上而不是真实的基础上运行。虚拟化技术可以扩大硬件的容量，简化软件的重新配置过程。CPU的虚拟化技术可以单CPU模拟多CPU 并行，允许一个平台同时运行多个操作系统，并且应用程序都可以在相互独立的空间内运行而互不影响，从而显著提高计算机的工作效率。&emsp;&ensp;虚拟化技术与多任务以及超线程技术是完全不同的。多任务是指在一个操作系统中多个程序同时并行运行，而在虚拟化技术中，则可以同时运行多个操作系统，而且每一个操作系统中都有多个程序运行，每一个操作系统都运行在一个虚拟的CPU或者是虚拟主机上；而超线程技术只是单CPU模拟双CPU来平衡程序运行性能，这两个模拟出来的CPU是不能分离的，只能协同工作。虚拟化技术也与如今VMware Workstation等同样能达到虚拟效果的软件不同，是一个巨大的技术进步，具体表现在减少软件虚拟机相关开销和支持更广泛的操作系统方面。 虚拟化技术的特点： **Fidelity(保真性)**：应用系统程序在虚拟机上执行，除了时间因素外（会比物理硬件上执行慢一点），将表现为与在物理硬件上相同的执行行为。 **Performance(高性能)**：在虚拟环境中应用程序绝大多数指令在虚拟机管理器不受干预的情况下，直接在物理硬件上执行。 **Safety(安全性)**：物理硬件由虚拟机管理器全权管理，被虚拟出来的执行环境的程序（包括操作系统）不能直接访问物理硬件。二、四种虚拟化技术： 虚拟机技术 &emsp;&ensp;在虚拟机技术（Virtual Machine Monitor）中，不再对底层的硬件资源进行划分，而是部署一个统一的Host系统。在Host系统上，加装了Virtual Machine Monitor，虚拟层作为应用级别的软件而存在，不涉及操作系统内核。虚拟层会给每个虚拟机模拟一套独立的硬件设备，包含CPU、内存、主板、显卡、网卡等硬件资源，在其上安装所谓的Guest操作系统。最终用户的应用程序，运行在Guest操作系统中。这种虚拟机运行的方式有一定的优点，比如能在一个节点上安装多个不同类型的操作系统；但缺点也非常明显，虚拟硬件设备要消耗资源，大量代码需要被翻译执行，造成了性能的损耗，使其更合适用于实验室等特殊环境。其代表产品有EMC旗下的VMware系列、微软旗下的Virtual PC/Server系列等。2. 硬件分区技术 &emsp;&ensp;硬件分区技术：硬件资源被划分成数个分区，每个分区享有独立的CPU、内存，并安装独立的操作系统。在一台服务器上，存在有多个系统实例，同时启动了多个操作系统。这种分区方法的主要缺点是缺乏很好的灵活性，不能对资源做出有效调配。随着技术的进步，如今对于资源划分的颗粒已经远远提升，例如在IBM AIX系统上，对CPU资源的划分颗粒可以达到0.1个CPU。这种分区方式，在目前的金融领域，比如在银行信息中心得到了广泛采用。3. 虚拟机技术 &emsp;&ensp;在虚拟机技术（Virtual Machine Monitor）中，不再对底层的硬件资源进行划分，而是部署一个统一的Host系统。在Host系统上，加装了Virtual Machine Monitor，虚拟层作为应用级别的软件而存在，不涉及操作系统内核。虚拟层会给每个虚拟机模拟一套独立的硬件设备，包含CPU、内存、主板、显卡、网卡等硬件资源，在其上安装所谓的Guest操作系统。最终用户的应用程序，运行在Guest操作系统中。这种虚拟机运行的方式有一定的优点，比如能在一个节点上安装多个不同类型的操作系统；但缺点也非常明显，虚拟硬件设备要消耗资源，大量代码需要被翻译执行，造成了性能的损耗，使其更合适用于实验室等特殊环境。其代表产品有EMC旗下的VMware系列、微软旗下的Virtual PC/Server系列等。4. 准虚拟机技术 &emsp;&ensp;为了改善虚拟机技术（Virtual Machine Monitor）的性能，一种新的准虚拟化技术（Para-Virtualizion）技术诞生了。这种虚拟技术以Xen为代表，其特点是修改操作系统的内核，加入一个Xen Hypervisor层。它允许安装在同一硬件设备上的多个系统可以同时启动，由Xen Hypervisor来进行资源调配。在这种虚拟环境下，依然需要模拟硬件设备，安装Guest操作系统，并且还需要修改操作系统的内核。Xen相对于传统的Virtual Machine Monitor，性能稍有提高，但并不十分显著。为了进一步提高性能，Intel和AMD分别开发了VT和Pacifica虚拟技术，将虚拟指令加入到了CPU中。使用了CPU支持的硬件虚拟技术，将不再需要修改操作系统内核，而是由CPU特有的指令集进行相应的转换操作。 二、分布式框架Hadoop&emsp;&ensp;Hadoop是Apache开源组织的一个分布式计算开源框架。Hadoop框架中最核心的设计就是：MapReduce和HDFS。MapReduce的思想是由Google的一篇论文所提及而被广为流传的，简单的一句话解释MapReduce就是“任务的分解与结果的汇总”。HDFS是Hadoop分布式文件系统（Hadoop Distributed File System）的缩写，为分布式计算存储提供了底层支持。 &emsp;&ensp;MapReduce从它名字上来看就大致可以看出个缘由，两个动词Map和Reduce，“Map（展开）”就是将一个任务分解成为多个任务，“Reduce”就是将分解后多任务处理的结果汇总起来，得出最后的分析结果。这不是什么新思想，其实在前面提到的多线程，多任务的设计就可以找到这种思想的影子。不论是现实社会，还是在程序设计中，一项工作往往可以被拆分成为多个任务，任务之间的关系可以分为两种：一种是不相关的任务，可以并行执行；另一种是任务之间有相互的依赖，先后顺序不能够颠倒，这类任务是无法并行处理的。回到大学时期，教授上课时让大家去分析关键路径，无非就是找最省时的任务分解执行方式。在分布式系统中，机器集群就可以看作硬件资源池，将并行的任务拆分，然后交由每一个空闲机器资源去处理，能够极大地提高计算效率，同时这种资源无关性，对于计算集群的扩展无疑提供了最好的设计保证。（其实我一直认为Hadoop的卡通图标不应该是一个小象，应该是蚂蚁，分布式计算就好比蚂蚁吃大象，廉价的机器群可以匹敌任何高性能的计算机，纵向扩展的曲线始终敌不过横向扩展的斜线）。任务分解处理以后，那就需要将处理以后的结果再汇总起来，这就是Reduce要做的工作。 三、分布式数据库HBaseHBase是一个面向列的分布式数据库。HBase 不是一个关系型数据库，其设计目标是用来解决关系型数据库在处理海量数据时的理论和实现上的局限性。传统关系型数据库在上世纪七十年代为交易系统设计，以满足数据一致性(ACID)为目标，并没有考虑数据规模扩大时的扩展性，以及单点系统失效时的可靠性。虽然经过多年的技术发展，产生了一些对关系性数据库的修补(并行数据库)，然而受限于理论和实现上的约束，扩展性从来没有超过 40 个服务器节点。而 HBase 从一开始就是为 Terabyte 到Petabyte 级别的海量数据存储和高速读写而设计，这些数据要求能够被分布在数千台普通服务器上，并且能够被大量并发用户高速访问。HBase从2008年第一次商用开始，已经被越来越多的在线服务公司所采用。其中最大的是Facebook新上线的整合Email，SNS，Chat和短消息的在线即时消息系统。 参考资料虚拟化技术百度百科Hadoop分布式系统架构详解CSDN博客分布式计算hadoop介绍hadoop框架介绍与分布式概念的简单理解CSDN博客分布式数据库HBase简介","categories":[],"tags":[]},{"title":"我的hexo博客创建内容分享","slug":"我的hexo博客创建内容分享","date":"2021-08-18T16:00:00.000Z","updated":"2021-08-22T02:59:05.370Z","comments":true,"path":"2021/08/19/我的hexo博客创建内容分享/","link":"","permalink":"http://example.com/2021/08/19/%E6%88%91%E7%9A%84hexo%E5%8D%9A%E5%AE%A2%E5%88%9B%E5%BB%BA%E5%86%85%E5%AE%B9%E5%88%86%E4%BA%AB/","excerpt":"&emsp;&ensp;Hexo是一个快速, 简洁且高效的博客框架. 让上百个页面在几秒内瞬间完成渲染. Hexo支持Github Flavored Markdown的所有功能, 甚至可以整合Octopress的大多数插件. 并自己也拥有强大的插件系统.","text":"&emsp;&ensp;Hexo是一个快速, 简洁且高效的博客框架. 让上百个页面在几秒内瞬间完成渲染. Hexo支持Github Flavored Markdown的所有功能, 甚至可以整合Octopress的大多数插件. 并自己也拥有强大的插件系统. 一、本次搭建hexo博客在B站上找到了两个比较详细和完整的教学视频 程序羊 mac版 函博 win版 二、搭建hexo所要用到的软件 node：hexo博客就是在node的基础上搭建起来的。 git:在搭建hexo博客时需要用到的软件。git下载完成后不会安装的同学可以参考这篇教程git的使用和安装. visual studio code:功能强大且轻巧的免费代码编辑器具有集成工具，可轻松地将代码部署到 Azure。Visual Studio Code的下载安装、快捷键以及插件离线安装。因为国内不能访问外网的原因，后两款软件可以在腾讯软件中心里下载。（注：蓝色文字为超链接） github搭建hexo需要的域名、仓库都需要在github里创建并传输上去。使用github搭建的hexo是免费的不需要花钱买域名。（注：登录github需要VPN） 三、创建好hexo博客后根据视频使用yilia主题配置以下是我在配置yilia主题时参考的教程 Hexo + Next 主题实现全局播放背景音乐 hexo主题yilia个性化（一言，左侧栏自定义，图片自定义…） 【Hexo搭建个人博客】：yilia主题配置(二) - 背景图片 Hexo yilia 主题一揽子使用方案 荷塘月色的hexo博客hexo博客yilia主题深度设置注：以上教程有些内容重复，hexo音乐只能用网易云生成的外链，网易云不能全局播放。 感谢原作者：yilia主题作者的github仓库 已经可以熟练搭建hexo博客的同学可以使用試毅-思伟yilia-plus主题。具体详情请访问作者博客。 （注：蓝色文字为超链接）","categories":[],"tags":[]},{"title":"中国云计算公司介绍","slug":"中国云计算公司介绍","date":"2021-08-18T06:41:02.000Z","updated":"2021-08-20T03:40:43.614Z","comments":true,"path":"2021/08/18/中国云计算公司介绍/","link":"","permalink":"http://example.com/2021/08/18/%E4%B8%AD%E5%9B%BD%E4%BA%91%E8%AE%A1%E7%AE%97%E5%85%AC%E5%8F%B8%E4%BB%8B%E7%BB%8D/","excerpt":"&emsp;&ensp;云计算是一个囊括了开发，负载平衡，商业模式，以及架构的时髦词，是软件业的未来模式，或者简单地讲，云计算就是以 Internet 为中心的软件。——Reuven Cohen","text":"&emsp;&ensp;云计算是一个囊括了开发，负载平衡，商业模式，以及架构的时髦词，是软件业的未来模式，或者简单地讲，云计算就是以 Internet 为中心的软件。——Reuven Cohen 华为云一、简介：&emsp;&ensp;华为云成立于2005年，隶属于华为公司，专注于云计算中公有云领域的技术研究与生态拓展，致力于为用户提供一站式云计算基础设施服务。&emsp;&ensp;华为云立足于互联网领域，提供包括云主机、云托管、云存储等基础云服务、超算、内容分发与加速、视频托管与发布、企业IT、云电脑、云会议、游戏托管、应用托管等服务和解决方案。&emsp;&ensp;华为云通过基于浏览器的云管理平台，以互联网线上自助服务的方式，为用户提供云计算IT基础设施服务。云计算的最大优势在于IT基础设施资源能够随用户业务的实际变化而弹性伸缩，用户需要多少资源就用多少资源，通过这种弹性计算的能力和按需计费的方式有效帮助用户降低运维成本。&emsp;&ensp;2021年，IDC发布《中国公有云服务市场（2020第四季度）跟踪》报告，显示2020年第四季度中国IaaS市场规模为34.9亿美元，华为与腾讯并列第二。 二、特点： 华为云产品和服务严格按照行业规范，在行业固有技术的基础上也做了改进和创新。 引入了多项华为独有的新技术，通过以降低成本、弹性灵活、电信级安全、高效自助管理等优势惠及用户。三、主要产品： 弹性计算：&emsp;&ensp;弹性计算云（ECC—Elastic Computing Cloud）是整合了计算、存储与网络资源，按需使用、按需付费的一站式IT计算资源租用服务。 存储服务：&emsp;&ensp;华为对象存储服务（Object Storage Services）是一个基于对象的云存储服务。 桌面云：&emsp;&ensp;桌面云是采用最新的云计算技术开发出的一款智能终端产品。 云云协同：&emsp;&ensp;在华为云TechWave技术峰会上，华为云宣布“云云协同”策略，华为云和华为终端云在能力和生态两方面深度协同，实现to B和to C的全生态融合。 &emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp; 参考资料https://baike.baidu.com/item/华为云/4572949?fr=aladdin 华为云官网：https://www.huaweicloud.com/ 百度云一、简介：&emsp;&ensp;百度智能云于2015年正式对外开放运营，是基于百度多年技术沉淀打造的智能云计算品牌，致力于为客户提供全球领先的人工智能、大数据和云计算服务。凭借先进的技术和丰富的解决方案，全面赋能各行业，加速产业智能化。&emsp;&ensp;百度智能云为金融、城市、医疗、客服与营销、能源、制造、电信、文娱、交通等众多领域领军企业提供服务，包括中国联通、国家电网、南方电网、浦发银行、成都高新减灾研究所、央视网、携程、四川航空等诸多客户。&emsp;&ensp;2019年4月，百度云品牌全面升级为“百度智能云”。&emsp;&ensp;2021年2月26日，中国华能集团与百度公司在华能总部签署《合作备忘录》，共同推动数字经济和能源电力产业深度融合。 二、特点： 百度智能云是中国AI的先行者；在深度学习、自然语言处理、语音技术和视觉技术等核心AI技术领域优势明显，百度大脑、飞桨深度学习平台则是AI产业基础设施。 百度全球AI专利申请量位列中国第一，并在语音识别、自然语言处理、知识图谱和自动驾驶四个细分领域排名国内第一，展示出AI新基建领军者深厚的技术底蕴和敏捷的创新能力。 百度大脑AI大生产平台已对外开放250+项核心AI能力，日调用1万亿次，服务190万+开发者；作为AI大生产平台的基础底座，飞桨深度学习平台定制化训练平台上服务企业8.4万家,发布模型数量23万+个。 在芯片方面，百度自主研发的昆仑AI芯片、鸿鹄AI芯片，可为新基建提供最可靠动力； 百度在语音识别、自然语言处理、知识图谱和自动驾驶四个领域，专利公开量国内均排名第一。 在网络方面，拥有100T级别的带宽，近千个边缘节点，还拥有国内最早大规模应用自研的万兆、25G、100网络设备。 百度数据中心覆盖已北京、保定、苏州、南京、广州、阳泉、西安、武汉、香港、新加坡等10多个国家和地区。阳泉数据中心是亚洲单体最大数据中心。三、平台架构： AI平台 知识中台 智能视频 智能大数据 智能互联网 区块链平台 云原生平台四、热门产品： 人工智能 计算与网络 存储和CDN 网站服务 智能视频 智能大数据 &emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp; 参考资料https://baike.baidu.com/item/百度智能云/23409424?fr=aladdin 百度智能云官网：https://cloud.baidu.com/ 阿里云一、简介：&emsp;&ensp;阿里云创立于2009年，是全球领先的云计算及人工智能科技公司，致力于以在线公共服务的方式，提供安全、可靠的计算和数据处理能力，让计算和人工智能成为普惠科技。阿里云服务着制造、金融、政务、交通、医疗、电信、能源等众多领域的领军企业，包括中国联通、12306、中石化、中石油、飞利浦、华大基因等大型企业客户，以及微博、知乎、锤子科技等明星互联网公司。在天猫双11全球狂欢节、12306春运购票等极富挑战的应用场景中，阿里云保持着良好的运行纪录。 &emsp;&ensp;阿里云在全球各地部署高效节能的绿色数据中心，利用清洁计算为万物互联的新世界提供源源不断的能源动力，目前开服的区域包括中国（华北、华东、华南、香港）、新加坡、美国（美东、美西）、欧洲、中东、澳大利亚、日本。 &emsp;&ensp;2014年，阿里云曾帮助用户抵御全球互联网史上最大的DDoS攻击，峰值流量达到每秒453.8Gb。在Sort Benchmark 2016 排序竞赛 CloudSort项目中，阿里云以1.44$/TB的排序花费打破了AWS保持的4.51$/TB纪录。在Sort Benchmark 2015，阿里云利用自研的分布式计算平台ODPS，377秒完成100TB数据排序，刷新了Apache Spark 1406秒的世界纪录。&emsp;&ensp;2019年3月3日凌晨，阿里云深夜出现故障，阿里云官方回复，华北2地域可用区C部分ECS服务器等实例出现IO HANG持续了三个小时左右，经紧急排查处理后逐步恢复。2019年6月11日，阿里云入选“2019福布斯中国最具创新力企业榜”。 二、云计算价值： 移动+云计算=实现了IT服务的“在线化“，让技术的门槛大幅降低。 云计算是公共服务，是可变成本，可按需使用，不再是固定资产投入，创业公司的成本压力由此大幅下降。 云计算将数据变成生产资料和企业资产。 云计算，是用足够的低成本、商业化的模式来解决大计算的问题。以前大家只会想到超级计算机，它的运营成本高，而反应速度还是很慢，当这些大的互联网应用真正发展时，比如淘宝，数亿商家提出的购买需要，实时信息匹配的背后，就是大数据的计算。所以，云计算就是使用分布式的方法，针对海量数据大计算的一种解决方案。如果没有计算能力，我们谈不上大数据的时代，更谈不上海量数据的高效应用。 马云在2016杭州云栖大会上提出了五新：“新零售，新制造，新金融，新技术，新能源”，阿里云正在成为这“五新”的经济基础设施，其自主研发的超大规模通用计算操作系统飞天，可以将遍布全球的百万级服务器连成一台超级计算机，以在线公共服务的方式为社会提供计算能力。阿里云总裁胡晓明表示：接下来的3~5年，云计算、大数据不仅将在互联网内发生改变，同样会在工业制造、农业作业、城市交通，以及基因学、医疗影像、教育娱乐等领域产生赋能。“云计算、大数据会对各行各业的基础生态产生改变，阿里巴巴希望把已有的能力进行输出，给予更多的创新者、创业者以及政府机构和国内外的合作者们。”三、主要产品： 飞天（Apsara）操作系统 人工智能ET 弹性计算 数据库 存储 网络 大数据 云安全 互联网中间件 分析 应用服务 视频服务 移动服务 云通信 域名与网站 行业解决方案 &emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp; 参考资料https://baike.baidu.com/item/%E9%98%BF%E9%87%8C%E4%BA%91/297128?fr=aladdin 阿里云官网：https://www.aliyun.com/?spm=5176.19720258.J_8058803260.1.c9a82c4abPD6to","categories":[],"tags":[]},{"title":"云计算简介","slug":"云计算简介","date":"2021-08-18T05:59:34.000Z","updated":"2021-08-20T04:01:23.312Z","comments":true,"path":"2021/08/18/云计算简介/","link":"","permalink":"http://example.com/2021/08/18/%E4%BA%91%E8%AE%A1%E7%AE%97%E7%AE%80%E4%BB%8B/","excerpt":"&emsp;&ensp;云计算指的是一个大的宏图，基本上说，就是让用户透过 Internet 访问技术服务，现在，我每次登陆 Facebook 或搜索航班，事实上都是在使用云计算。———Praising Gaw","text":"&emsp;&ensp;云计算指的是一个大的宏图，基本上说，就是让用户透过 Internet 访问技术服务，现在，我每次登陆 Facebook 或搜索航班，事实上都是在使用云计算。———Praising Gaw 一、云计算(1).云计算的定义&emsp;&ensp;云计算（cloud computing）是分布式计算的一种，指的是通过网络“云”将巨大的数据计算处理程序分解成无数个小程序，然后，通过多部服务器组成的系统进行处理和分析这些小程序得到结果并返回给用户。云计算早期，简单地说，就是简单的分布式计算，解决任务分发，并进行计算结果的合并。因而，云计算又称为网格计算。通过这项技术，可以在很短的时间内（几秒钟）完成对数以万计的数据的处理，从而达到强大的网络服务。&emsp;&ensp;现阶段所说的云服务已经不单单是一种分布式计算，而是分布式计算、效用计算、负载均衡、并行计算、网络存储、热备份冗杂和虚拟化等计算机技术混合演进并跃升的结果。&emsp;&ensp;“云”实质上就是一个网络，狭义上讲，云计算就是一种提供资源的网络，使用者可以随时获取“云”上的资源，按需求量使用，并且可以看成是无限扩展的，只要按使用量付费就可以，“云”就像自来水厂一样，我们可以随时接水，并且不限量，按照自己家的用水量，付费给自来水厂就可以。 &emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp; 中文名 云计算 特点 超大规模 外文名 Cloud Computing 应用 金融、教育等 性质 分布式计算 服务类型 IaaS、PaaS、SaaS (2).概述：&emsp;&ensp;从广义上说，云计算是与信息技术、软件、互联网相关的一种服务，这种计算资源共享池叫做“云”，云计算把许多计算资源集合起来，通过软件实现自动化管理，只需要很少的人参与，就能让资源被快速提供。也就是说，计算能力作为一种商品，可以在互联网上流通，就像水、电、煤气一样，可以方便地取用，且价格较为低廉。&emsp;&ensp;总之，云计算不是一种全新的网络技术，而是一种全新的网络应用概念，云计算的核心概念就是以互联网为中心，在网站上提供快速且安全的云计算服务与数据存储，让每一个使用互联网的人都可以使用网络上的庞大计算资源与数据中心。&emsp;&ensp;云计算是继互联网、计算机后在信息时代又一种新的革新，云计算是信息时代的一个大飞跃，未来的时代可能是云计算的时代，虽然目前有关云计算的定义有很多，但总体上来说，云计算虽然有许多得含义，但概括来说，云计算的基本含义是一致的，即云计算具有很强的扩展性和需要性，可以为用户提供一种全新的体验，云计算的核心是可以将很多的计算机资源协调在一起，因此，使用户通过网络就可以获取到无限的资源，同时获取的资源不受时间和空间的限制。 （3）.发展历程：&emsp;&ensp;云计算这个概念从提出到今天，已经差不多10年了。在这10年间，云计算取得了飞速的发展与翻天覆地的变化。现如今，云计算被视为计算机网络领域的一次革命，因为它的出现，社会的工作方式和商业模式也在发生巨大的改变。&emsp;&ensp;追溯云计算的根源，它的产生和发展与之前所提及的并行计算、分布式计算等计算机技术密切相关，都促进着云计算的成长。但追溯云计算的历史，可以追溯到1956年，ChristopherStrachey发表了一篇有关虚拟化的论文，正式提出了虚拟化的概念。虚拟化是今天云计算基础架构的核心，是云计算发展的基础。而后随着网络技术的发展，逐渐孕育了云计算的萌芽。&emsp;&ensp;在上世纪的90年代，计算机网络出现了大爆炸，出现了以思科为代表以一系列公司，随即网络出现泡沫时代。 &emsp;&ensp;在2004年，Web2.0会议举行，Web2.0成为当时的热点，这也标志着互联网泡沫破灭，计算机网络发展进入了一个新的阶段。在这一阶段，让更多的用户方便快捷地使用网络服务成为会联网发展亟待解决的问题，与此同时，一些大型公司也开始致力于开发大型计算能力的技术，为用户提供了更加强大的计算处理服务。&emsp;&ensp;在2006年8月9日，Google首席执行官埃里克·施密特（Eric Schmidt）在搜索引擎大会（SESSanJose2006）首次提出“云计算”（Cloud Computing）的概念。这是云计算发展史上第一次正式地提出这一概念，有着巨大的历史意义。&emsp;&ensp;2007年以来，“云计算”成为了计算机领域最令人关注的话题之一，同样也是大型企业、互联网建设着力研究的重要方向。因为云计算的提出，互联网技术和IT服务出现了新的模式，引发了一场变革。 &emsp;&ensp;在2008年，微软发布其公共云计算平台（Windows Azure Platform），由此拉开了微软的云计算大幕。同样，云计算在国内也掀起一场风波，许多大型网络公司纷纷加入云计算的阵列。&emsp;&ensp;2009年1月，阿里软件在江苏南京建立首个“电子商务云计算中心”。同年11月，中国移动云计算平台“大云”计划启动。到现阶段，云计算已经发展到较为成熟的阶段。 &emsp;&ensp;2019年8月17日，北京互联网法院发布《互联网技术司法应用白皮书》。发布会上，北京互联网法院互联网技术司法应用中心揭牌成立。 （4）.特点： 云计算的可贵之处在于高灵活性、可扩展性和高性比等，与传统的网络应用模式相比，其具有如下优势与特点： &emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp; 1、虚拟化技术。&emsp;&ensp;必须强调的是，虚拟化突破了时间、空间的界限，是云计算最为显著的特点，虚拟化技术包括应用虚拟和资源虚拟两种。众所周知，物理平台与应用部署的环境在空间上是没有任何联系的，正是通过虚拟平台对相应终端操作完成数据备份、迁移和扩展等。 2、动态可扩展。&emsp;&ensp;云计算具有高效的运算能力，在原有服务器基础上增加云计算功能能够使计算速度迅速提高，最终实现动态扩展虚拟化的层次达到对应用进行扩展的目的。 3、按需部署。&emsp;&ensp;计算机包含了许多应用、程序软件等，不同的应用对应的数据资源库不同，所以用户运行不同的应用需要较强的计算能力对资源进行部署，而云计算平台能够根据用户的需求快速配备计算能力及资源。 4、灵活性高。&emsp;&ensp;目前市场上大多数IT资源、软、硬件都支持虚拟化，比如存储网络、操作系统和开发软、硬件等。虚拟化要素统一放在云系统资源虚拟池当中进行管理，可见云计算的兼容性非常强，不仅可以兼容低配置机器、不同厂商的硬件产品，还能够外设获得更高性能计算。 5、可靠性高。&emsp;&ensp;倘若服务器故障也不影响计算与应用的正常运行。因为单点服务器出现故障可以通过虚拟化技术将分布在不同物理服务器上面的应用进行恢复或利用动态扩展功能部署新的服务器进行计算。 6、性价比高。&emsp;&ensp;将资源放在虚拟资源池中统一管理在一定程度上优化了物理资源，用户不再需要昂贵、存储空间大的主机，可以选择相对廉价的PC组成云，一方面减少费用，另一方面计算性能不逊于大型主机。 7、可扩展性。&emsp;&ensp;用户可以利用应用软件的快速部署条件来更为简单快捷的将自身所需的已有业务以及新业务进行扩展。如，计算机云计算系统中出现设备的故障，对于用户来说，无论是在计算机层面上，亦或是在具体运用上均不会受到阻碍，可以利用计算机云计算具有的动态扩展功能来对其他服务器开展有效扩展。这样一来就能够确保任务得以有序完成。在对虚拟化资源进行动态扩展的情况下，同时能够高效扩展应用，提高计算机云计算的操作水平。 二、服务类型&emsp;&ensp;通常，它的服务类型分为三类，即基础设施即服务(IaaS)、平台即服务(PaaS)和软件即服务(SaaS)。这3种云计算服务有时称为云计算堆栈，因为它们构建堆栈，它们位于彼此之上，以下是这三种服务的概述： 基础设施即服务（IaaS)&emsp;&ensp;基础设施即服务是主要的服务类别之一，它向云计算提供商的个人或组织提供虚拟化计算资源，如虚拟机、存储、网络和操作系统。 平台即服务(PaaS)&emsp;&ensp;平台即服务是一种服务类别，为开发人员提供通过全球互联网构建应用程序和服务的平台。Paas为开发、测试和管理软件应用程序提供按需开发环境。 软件即服务(SaaS)&emsp;&ensp;软件即服务也是其服务的一类，通过互联网提供按需软件付费应用程序，云计算提供商托管和管理软件应用程序，并允许其用户连接到应用程序并通过全球互联网访问应用程序。云计算实现关键技术，云计算实现关键技术如下： 二（1）、体系结构&emsp;&ensp;实现计算机云计算需要创造一定的环境与条件，尤其是体系结构必须具备以下关键特征。第一，要求系统必须智能化，具有自治能力，减少人工作业的前提下实现自动化处理平台智地响应要求，因此云系统应内嵌有自动化技术；第二，面对变化信号或需求信号云系统要有敏捷的反应能力，所以对云计算的架构有一定的敏捷要求。与此同时，随着服务级别和增长速度的快速变化，云计算同样面临巨大挑战，而内嵌集群化技术与虚拟化技术能够应付此类变化。云计算平台的体系结构由用户界面、服务目录、管理系统、部署工具、监控和服务器集群组成： 用户界面。主要用于云用户传递信息，是双方互动的界面。 服务目录。顾名思义是提供用户选择的列表。 管理系统。指的是主要对应用价值较高的资源进行管理。 部署工具。能够根据用户请求对资源进行有效地部署与匹配。 监控。主要对云系统上的资源进行管理与控制并制定措施。 服务器集群。服务器集群包括虚拟服务器与物理服务器，隶属管理系统。二（2）、资源监控&emsp;&ensp;云系统上的资源数据十分庞大，同时资源信息更新速度快，想要精准、可靠的动态信息需要有效途径确保信息的快捷性。而云系统能够为动态信息进行有效部署，同时兼备资源监控功能，有利于对资源的负载、使用情况进行管理。其次，资源监控作为资源管理的“血液”，对整体系统性能起关键作用，一旦系统资源监管不到位，信息缺乏可靠性那么其他子系统引用了错误的信息，必然对系统资源的分配造成不利影响。因此贯彻落实资源监控工作刻不容缓。资源监控过程中，只要在各个云服务器上部署Agent代理程序便可进行配置与监管活动，比如通过一个监视服务器连接各个云资源服务器，然后以周期为单位将资源的使用情况发送至数据库，由监视服务器综合数据库有效信息对所有资源进行分析，评估资源的可用性，最大限度提高资源信息的有效性。二（3）、自动化部署&emsp;&ensp;科学进步的发展倾向于半自动化操作，实现了出厂即用或简易安装使用。基本上计算资源的可用状态也发生转变，逐渐向自动化部署。对云资源进行自动化部署指的是基于脚本调节的基础上实现不同厂商对于设备工具的自动配置，用以减少人机交互比例、提高应变效率，避免超负荷人工操作等现象的发生，最终推进智能部署进程。自动化部署主要指的是通过自动安装与部署来实现计算资源由原始状态变成可用状态。其于与计算中表现为能够划分、部署与安装虚拟资源池中的资源为能够给用户提供各类应用于服务的过程，包括了存储、网络、软件以及硬件等。系统资源的部署步骤较多，自动化部署主要是利用脚本调用来自动配置、部署与配置各个厂商设备管理工具，保证在实际调用环节能够采取静默的方式来实现，避免了繁杂的人际交互，让部署过程不再依赖人工操作。除此之外，数据模型与工作流引擎是自动化部署管理工具的重要部分，不容小觑。一般情况下，对于数据模型的管理就是将具体的软硬件定义在数据模型当中即可；而工作流引擎指的是触发、调用工作流，以提高智能化部署为目的，善于将不同的脚本流程在较为集中与重复使用率高的工作流数据库当中应用，有利于减轻服务器工作量。 二（4）、云计算实现形式云计算是建立在先进互联网技术基础之上的，其实现形式众多，主要通过以下形式完成： 软件即服务。通常用户发出服务需求，云系统通过浏览器向用户提供资源和程序等。值得一提的是，利用浏览器应用传递服务信息不花费任何费用，供应商亦是如此，只要做好应用程序的维护工作即可。 网络服务。开发者能够在API的基础上不断改进、开发出新的应用产品，大大提高单机程序中的操作性能。 平台服务。一般服务于开发环境，协助中间商对程序进行升级与研发，同时完善用户下载功能，用户可通过互联网下载，具有快捷、高效的特点。 &emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp; 互联网整合。利用互联网发出指令时，也许同类服务众多，云系统会根据终端用户需求匹配相适应的服务。 商业服务平台。构建商业服务平台的目的是为了给用户和提供商提供一个沟通平台，从而需要管理服务和软件即服务搭配应用。 管理服务提供商。此种应用模式并不陌生，常服务于IT行业，常见服务内容有：扫描邮件病毒、监控应用程序环境等。二（5）、云计算安全威胁1、 云计算安全中隐私被窃取&emsp;&ensp;现今，随着时代的发展，人们运用网络进行交易或购物，网上交易在云计算的虚拟环境下进行，交易双方会在网络平台上进行信息之间的沟通与交流。而网络交易存在着很大的安全隐患，不法分子可以通过云计算对网络用户的信息进行窃取，同时还可以在用户与商家进行网络交易时，来窃取用户和商家的信息，当有企图的分子在云计算的平台中窃取信息后，就会采用一些技术手段对信息进行破解，同时对信息进行分析，以此发现用户更多的隐私信息，甚至有企图的不法分子还会通过云计算来盗取用户和商家的信息。2、云计算中资源被冒用&emsp;&ensp;云计算的环境有着虚拟的特性，而用户通过云计算在网络交易时，需要在保障双方网络信息都安全时才会进行网络的操作，但是云计算中储存的信息很多，同时在云计算中的环境也比较的复杂，云计算中的数据会出现滥用的现象，这样会影响用户的信息安全，同时造成一些不法分子利用被盗用的信息进行欺骗用户亲人的行为，同时还会有一些不法分子会利用这些在云计算中盗用的信息进行违法的交易，以此造成云计算中用户的经济遭到损失，这些都是云计算信息被冒用引起的，同时这些都严重威胁了云计算的安全。 3、云计算中容易出现黑客的攻击&emsp;&ensp;黑客攻击指的是利用一些非法的手段进入云计算的安全系统，给云计算的安全网络带来一定的破坏的行为，黑客入侵到云计算后，使云计算的操作带来未知性，同时造成的损失也很大，且造成的损失无法预测，所以黑客入侵给云计算带来的危害大于病毒给云计算带来的危害。此外，黑客入侵的速度远大于安全评估和安全系统的更新速度，使得当今黑客入侵到电脑后，给云计算带来巨大的损失，同时技术也无法对黑客攻击进行预防，这也是造成当今云计算不安全的问题之一。4、云计算中容易出现病毒&emsp;&ensp;在云计算，大量的用户通过云计算将数据存储到其中，这时大量当云计算出现异常时，就会出现一些病毒，这些病毒的出现会导致以云计算为载体的计算机无法正常工作的现象，同时这些病毒还能进行复制，并通过一些途径进行传播，这样就会导致为云计算为载体的计算机出现死机的现象，同时，因为互联网的传播速度很快，导致云计算或计算机一旦出现病毒，就会很快地进行传播，这样会产生很大的攻击力。 &emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp; 三、云计算的应用&emsp;&ensp;较为简单的云计算技术已经普遍服务于现如今的互联网服务中，最为常见的就是网络搜索引擎和网络邮箱。搜索引擎大家最为熟悉的莫过于谷歌和百度了，在任何时刻，只要用过移动终端就可以在搜索引擎上搜索任何自己想要的资源，通过云端共享了数据资源。而网络邮箱也是如此，在过去，寄写一封邮件是一件比较麻烦的事情，同时也是很慢的过程，而在云计算技术和网络技术的推动下，电子邮箱成为了社会生活中的一部分，只要在网络环境下，就可以实现实时的邮件的寄发。其实，云计算技术已经融入现今的社会生活。 &emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp; 1、存储云&emsp;&ensp;存储云，又称云存储，是在云计算技术上发展起来的一个新的存储技术。云存储是一个以数据存储和管理为核心的云计算系统。用户可以将本地的资源上传至云端上，可以在任何地方连入互联网来获取云上的资源。大家所熟知的谷歌、微软等大型网络公司均有云存储的服务，在国内，百度云和微云则是市场占有量最大的存储云。存储云向用户提供了存储容器服务、备份服务、归档服务和记录管理服务等等，大大方便了使用者对资源的管理。 2、医疗云&emsp;&ensp;医疗云，是指在云计算、移动技术、多媒体、4G通信、大数据、以及物联网等新技术基础上，结合医疗技术，使用“云计算”来创建医疗健康服务云平台，实现了医疗资源的共享和医疗范围的扩大。因为云计算技术的运用于结合，医疗云提高医疗机构的效率，方便居民就医。像现在医院的预约挂号、电子病历、医保等等都是云计算与医疗领域结合的产物，医疗云还具有数据安全、信息共享、动态扩展、布局全国的优势。 3、金融云&emsp;&ensp;金融云，是指利用云计算的模型，将信息、金融和服务等功能分散到庞大分支机构构成的互联网“云”中，旨在为银行、保险和基金等金融机构提供互联网处理和运行服务，同时共享互联网资源，从而解决现有问题并且达到高效、低成本的目标。在2013年11月27日，阿里云整合阿里巴巴旗下资源并推出来阿里金融云服务。其实，这就是现在基本普及了的快捷支付，因为金融与云计算的结合，现在只需要在手机上简单操作，就可以完成银行存款、购买保险和基金买卖。现在，不仅仅阿里巴巴推出了金融云服务，像苏宁金融、腾讯等等企业均推出了自己的金融云服务。 4、教育云&emsp;&ensp;教育云，实质上是指教育信息化的一中发展。具体的，教育云可以将所需要的任何教育硬件资源虚拟化，然后将其传入互联网中，以向教育机构和学生老师提供一个方便快捷的平台。现在流行的慕课就是教育云的一种应用。慕课MOOC，指的是大规模开放的在线课程。现阶段慕课的三大优秀平台为Coursera、edX以及Udacity，在国内，中国大学MOOC也是非常好的平台。在2013年10月10日，清华大学推出来MOOC平台——学堂在线，许多大学现已使用学堂在线开设了一些课程的MOOC。 四、云计算发展问题1、访问的权限问题&emsp;&ensp;用户可以在云计算服务提供商处上传自己的数据资料，相比于传统的利用自己计算机或硬盘的存储方式，此时需要建立账号和密码完成虚拟信息的存储和获取。这种方式虽然为用户的信息资源获取和存储提供了方便，但用户失去了对数据资源的控制，而服务商则可能存在对资源的越权访问现象，从而造成信息资料的安全难以保障。 2、技术保密性问题&emsp;&ensp;信息保密性是云计算技术的首要问题，也是当前云计算技术的主要问题。比如，用户的资源被一些企业进行资源共享。网络环境的特殊性使得人们可以自由的浏览相关薪资资源，信息资源泄漏是难以避免的，如果技术保密性不足就可能严重影响到信息资源的所有者。 3、数据完整性问题&emsp;&ensp;在云计算技术的使用中，用户的数据被分散的存储与云计算数据中心的不同位置，而不是某个单一的系统中，数据资源的整体性受到影响，使其作用难以有效发挥。另一种情况就是，服务商没有妥善、有效的管理用户的数据信息，从而造成数据存储的完整性受到影响，信息的应用作用难以被发挥。 4、法律法规不完善&emsp;&ensp;云计算技术相关的法律法规不完善也是主要的问题，想要对实现对云计算技术作用的有效发挥，就必须对其相关的法律法规进行完善。目前来看，法律法规尚不完善，云计算技术的作用的发挥仍然受到制约。就当前云计算技术在计算机网络中的应用来看，其缺乏完善的安全性标准，缺乏完善的服务等级协议管理标准，没有明确的责任人承担安全问题的法律责任。另外，缺乏完善的云计算安全管理的损失计算机制和责任评估机制，法律规范的缺乏也制约了各种活动的开展，计算机网络的云计算安全性难以得到保障。 五、云计算完善措施&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp;&emsp;&ensp; 1、合理设置访问权限，保障用户信息安全&emsp;&ensp;当前，云计算机服务由供应商提供，为保障信息安全，供应商应针对用户端的需求情况，设置相应的访问权限，进而保障信息资源的安全分享。在开放式的互联网环境之下，供应商一方面要做好访问权限的设置工作，强化资源的合理分享及应用；另一方面，要做好加密工作，从供应商到用户都应强化信息安全防护，注意网络安全构建，有效保障用户安全。因此，云计算机技术的发展，应强化安全技术体系的构建，在访问权限的合理设置中，提高信息防护水平。 2、强化数据信息完整性，推进存储技术发展&emsp;&ensp;存储技术是计算机云计算技术的核心，如何强化数据信息的完整性，是云计算技术发展的重要方面。首先，云计算资源以离散的方式分布于云系统之中，要强化对云系统中数据资源的安全保护，并确保数据的完整性，这有助于提高信息资源的应用价值；其次，加快存储技术发展，特别是大数据时代，云计算技术的发展，应注重存储技术的创新构建；再次，要优化计算机网络云技术的发展环境，通过技术创新、理念创新，进一步适应新的发展环境，提高技术的应用价值，这是新时期计算机网络云计算机技术的发展重点。 3、建立健全法律法规，提高用户安全意识&emsp;&ensp;随着网络信息技术的不断发展，云计算应用的领域日益广泛。建立完善的法律法规，是为了更好地规范市场发展，强化对供应商、用户等行为的规范及管理，为计算机网络云计算技术的发展提供良好条件。此外，用户端要提高安全防护意识，能够在信息资源的获取中，遵守法律法规，规范操作，避免信息安全问题造成严重的经济损失。因此，新时期计算机网络云计算技术的发展，要从实际出发，通过法律法规的不断完善，为云计算机技术发展提供良好环境。 参考资料 云计算百度百科","categories":[],"tags":[]}],"categories":[],"tags":[]}